Revit 2024 API
DigitGroupingAmount Enumeration
 The number of digits in each group when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum DigitGroupingAmount
Visual Basic
Public Enumeration DigitGroupingAmount
Visual C++
public enum class DigitGroupingAmount
Members
Member name | Description
Two |  Digits are in groups of two, with the exception of the first group to the left of the decimal symbol which contains three digits.
Three |  Digits are in groups of three.
See Also
Autodesk.Revit.DB Namespace